import * as yup from "yup";

const schemaLogin = yup.object({
  name: yup
    .string()
    .matches(
      /^[a-zA-Zа-яА-ЯёЁіІїЇєЄґҐ0-9'][a-zA-Zа-яА-ЯёЁіІїЇєЄґҐ0-9']*$/,
      "Ім'я може містити лише літери, числа та апостроф"
    )
    .min(2, "Ім’я повинно містити щонайменше 2 символи")
    .max(20, "Ім’я повинно містити щонайменше 20 символи")
    .matches(/^\S*$/, "Ім'я не може містити пробілів")
    .required("Ім’я обов’язкове"),
  password: yup
    .string()
    .min(8, "Пароль повинен містити щонайменше 8 символів")
    .matches(/^\S*$/, "Пароль не може містити пробілів")
    .max(30, "Ім’я повинно містити щонайменше 30 символи")
    .required("Пароль обов’язковий"),
});

export default schemaLogin;
