import * as yup from "yup";

const schemaRegister = yup
  .object({
    email: yup
      .string()
      .email("Неправильний формат електронної пошти")
      .max(30, "Ім’я повинно містити щонайменше 30 символи")
      .required("Електронна пошта обов’язкова"),

    password: yup
      .string()
      .min(8, "Пароль повинен містити щонайменше 8 символів")
      .matches(/^\S*$/, "Пароль не може містити пробілів")
      .max(30, "Ім’я повинно містити щонайменше 30 символи")
      .required("Пароль обов’язковий"),

    repeatPassword: yup
      .string()
      .oneOf([yup.ref("password"), undefined], "Паролі не співпадають")
      .max(30, "Ім’я повинно містити щонайменше 30 символи")
      .required("Підтвердження паролю обов’язкове"),

    name: yup
      .string()
      .matches(
        /^[a-zA-Zа-яА-ЯёЁіІїЇєЄґҐ0-9'][a-zA-Zа-яА-ЯёЁіІїЇєЄґҐ0-9']*$/,
        "Ім'я може містити лише літери, числа та апостроф"
      )
      .min(2, "Ім’я повинно містити щонайменше 2 символи")
      .max(20, "Ім’я повинно містити щонайменше 20 символи")
      .matches(/^\S*$/, "Ім'я не може містити пробілів")
      .required("Ім’я обов’язкове"),
  })
  .required();

export default schemaRegister;
